chinaboard/dingdong/sdkconfig.defaults
# --- Target ---
CONFIG_IDF_TARGET="esp32c6"

# --- Flash ---
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# --- Partition Table ---
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# --- Bluetooth (NimBLE host) ---
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=2

# Extended advertising: 2 instances (HID + BTHome time broadcaster).
# HID instance uses legacy_pdu for iPhone backward-compat.
CONFIG_BT_NIMBLE_EXT_ADV=y
CONFIG_BT_NIMBLE_MAX_EXT_ADV_INSTANCES=2

# HID service (impersonate BLE keyboard so iPhone bonds and auto-reconnects)
CONFIG_BT_NIMBLE_HID_SERVICE=y
CONFIG_BT_NIMBLE_SVC_HID_MAX_RPTS=4

# Security manager: LE Secure Connections + bonding + Display-only IO cap
# so we can drive Passkey Entry from the Web UI.
CONFIG_BT_NIMBLE_SM_SC=y
CONFIG_BT_NIMBLE_SM_LEGACY=n
CONFIG_BT_NIMBLE_NVS_PERSIST=y

# Whitelist large enough to hold all bonded workers
CONFIG_BT_NIMBLE_WHITELIST_SIZE=16

# --- WiFi ---
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=y

# --- Logging ---
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_COLORS=y

# --- Tasks ---
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# --- OTA: rollback safety ---
# Bootloader auto-reverts to previous app if new image fails to call
# esp_ota_mark_app_valid_cancel_rollback() before reboot.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# --- Console over USB Serial/JTAG (ESP32-C6 native USB) ---
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# --- Size optimization ---
# Compiler -Os (default IDF is -Og debug). Single biggest single win — saves
# ~200-300 KB on this app.
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# Newlib nano formatting: smaller printf, no float by default. We don't print
# floats anywhere; if added, prefix with %.0f or use snprintf manual formatting.
CONFIG_NEWLIB_NANO_FORMAT=y

# Bring assertions to ENABLE (was 2 = SILENT — already was, but make explicit)
CONFIG_COMPILER_OPTIMIZATION_ASSERTION_LEVEL=2

# --- BLE: roles ---
# Peripheral (HID), Broadcaster (BTHome), AND Observer (continuous scan for
# bonded iPhones to detect presence via RPA resolution against stored IRK).
# Observer is the core attendance signal — without it we'd be relying on iOS
# to reconnect after iPhone wakes, which is unreliable and slow.
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y

# --- mbedTLS: keep only SHA-256 (PBKDF2 needs it). Drop SHA-1/384/512. ---
CONFIG_MBEDTLS_SHA1_C=n
CONFIG_MBEDTLS_SHA384_C=n
CONFIG_MBEDTLS_SHA512_C=n

# --- TLS / HTTPS: needed for GitHub OTA pull (no cert verify — see dd_ota_pull) ---
CONFIG_MBEDTLS_TLS_CLIENT=y
CONFIG_MBEDTLS_TLS_SERVER=n
CONFIG_MBEDTLS_TLS_CLIENT_ONLY=y
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y
CONFIG_ESP_WIFI_MBEDTLS_TLS_CLIENT=n
CONFIG_ESP_TLS_INSECURE=y
CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY=y
# Don't ship the Mozilla CA bundle — we deliberately don't verify (threat
# model is "fire-and-forget hobby device, brick recoverable via USB"; integrity
# guaranteed by SHA256 against GitHub Releases API `digest` field).
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=n

# --- mbedtls trim: features genuinely unused for our HTTPS-client-only path ---
# Server-side TLS bits — never used (we're a client to api.github.com only)
CONFIG_MBEDTLS_SSL_CACHE_C=n
CONFIG_MBEDTLS_SERVER_SSL_SESSION_TICKETS=n
# One-shot connections to GitHub — no point caching session state
CONFIG_MBEDTLS_CLIENT_SSL_SESSION_TICKETS=n
# TLS 1.2 doesn't renegotiate, TLS 1.3 doesn't have the concept
CONFIG_MBEDTLS_SSL_RENEGOTIATION=n
# Extension we don't request
CONFIG_MBEDTLS_SSL_MAX_FRAGMENT_LENGTH=n
# ALPN — esp_http_client unconditionally references the symbol, must keep
# Crypto algos genuinely not used by TLS 1.2/1.3 GCM ciphersuites
CONFIG_MBEDTLS_CMAC_C=n
CONFIG_MBEDTLS_PKCS7_C=n
CONFIG_MBEDTLS_HMAC_DRBG_C=n
# Only matters when we sign with ECDSA (we don't)
CONFIG_MBEDTLS_ECDSA_DETERMINISTIC=n
# Modern TLS uses GCM exclusively; drop legacy modes (CBC + CTR kept — wpa_supplicant
# uses both via aes-128-cbc and aes-siv for some WiFi auth flows)
CONFIG_MBEDTLS_CIPHER_MODE_CFB=n
CONFIG_MBEDTLS_CIPHER_MODE_OFB=n
CONFIG_MBEDTLS_CIPHER_MODE_XTS=n
CONFIG_MBEDTLS_CCM_C=n
CONFIG_MBEDTLS_GCM_SUPPORT_NON_AES_CIPHER=n
# Misc
CONFIG_MBEDTLS_FS_IO=n
CONFIG_MBEDTLS_SELF_TEST=n
CONFIG_MBEDTLS_VERSION_C=n
# X.509 features only needed for verification (which we skip) or generation
CONFIG_MBEDTLS_X509_CRL_PARSE_C=n
CONFIG_MBEDTLS_X509_CSR_PARSE_C=n
CONFIG_MBEDTLS_X509_RSASSA_PSS_SUPPORT=n
# We never write keys / certs / PEM (PEM_WRITE only — PK_WRITE is needed by
# wpa_supplicant for some WiFi auth derivations even when not using TLS)
CONFIG_MBEDTLS_PEM_WRITE_C=n
# Drop curves GitHub doesn't use (only secp256r1 needed for ECDHE-ECDSA)
CONFIG_MBEDTLS_ECP_DP_SECP384R1_ENABLED=n
CONFIG_MBEDTLS_ECP_DP_SECP521R1_ENABLED=n
CONFIG_MBEDTLS_ECP_DP_SECP256K1_ENABLED=n
CONFIG_MBEDTLS_ECP_DP_BP256R1_ENABLED=n
CONFIG_MBEDTLS_ECP_DP_BP384R1_ENABLED=n
CONFIG_MBEDTLS_ECP_DP_BP512R1_ENABLED=n
CONFIG_MBEDTLS_ECP_DP_CURVE25519_ENABLED=n
# RSA key exchange is legacy; modern TLS uses ECDHE
CONFIG_MBEDTLS_KEY_EXCHANGE_RSA=n
CONFIG_MBEDTLS_KEY_EXCHANGE_ECDHE_RSA=n

# --- LwIP: drop IPv6 (we only need IPv4 on the local network) ---
CONFIG_LWIP_IPV6=n

# --- DHCPS: shrink (used only briefly during SoftAP setup) ---
CONFIG_LWIP_DHCPS_MAX_STATION_NUM=2
CONFIG_LWIP_DHCPS_STATIC_ENTRIES=n
